app/views/users/show.html.haml

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---
  %h1 Your Photos
  - @user.photos.each  do |photo|

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
---
      %p Tags:
      - photo.tags.each do |tag|

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---
      %h3 Comments:
      -photo.comments.each do |comment|

SELECT "followers"."follower_id" FROM "followers" WHERE "followers"."user_id" = ?  [["user_id", 1]]
SELECT "users"."id" FROM "users"
---
    .well.col-sm-6
      - if @user.followers.pluck(:follower_id).include?(d.user_id)