app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("user_id", "photo_id", "comment") VALUES (?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["comment", "erfef"]]
---
  def create
    @user = User.find(params[:comment][:user_id])
    @comment = Comment.create({user_id: params[:comment][:user_id], photo_id: params[:comment][:photo_id],comment: params[:comment][:comment]})