app/controllers/followers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "followers" ("user_id", "follower_id") VALUES (?, ?)  [["user_id", 3], ["follower_id", 3]]
---
  def create
    @user = User.find(params[:user_id])
    @follower = Follower.create({user_id: params[:user_id],follower_id:params[:follower][:follower_id]})

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
---
  def new
    @user = User.find(params[:user_id])
    @users = User.all