app/controllers/photos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("caption", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["caption", "reref"], ["title", "f4rf"], ["created_at", "2020-12-05 18:07:11.117593"], ["updated_at", "2020-12-05 18:07:11.117593"]]
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2020-12-02 15:36:16.638474"], ["id", 2]]
---
  def create
    @user = User.find(params[:user_id])
    if params[:photo] == nil

      flash[:alert] = "Please upload a photo"
      redirect_to :back
    else
    @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 9]]
---
  def destroy
    @user = User.find(params[:user_id])
    @photo= Photo.find(params[:id])
    @photo.destroy