app/controllers/tags_controller.rb

  def create
    @user = User.find(params[:tag][:user_id])
    @tag = Tag.create({user_id: params[:tag][:user_id], photo_id: params[:tag][:photo_id]})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tags" ("user_id", "photo_id") VALUES (?, ?)  [["user_id", 1], ["photo_id", 2]]